<a href="https://colab.research.google.com/github/Sillians/2016-pydata-carolinas-pandas/blob/master/05_Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [0]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [0]:
#Create a different dataframe
Big_data = {'Brand':['Off-White', 'Off-White', 'Rochas', 'Rochas', 'Jacquemus', 'Jacquemus', 'Louboutin', 'Louboutin'],
           'Customers Name':['Mrs. Otodela', 'Mrs. Dozie', 'Mr. Adeleke', 'Mrs. Arinola', 'Ms. Ademola', 'Mrs. Fashola', 'Mr. Fagbemi', 'Mrs. Amike'],
           'Sales':[5000,3000,4000,5500,4500,1200,3450,4520]}

In [16]:
df1 = pd.DataFrame(Big_data)
df1

       Brand Customers Name  Sales
0  Off-White   Mrs. Otodela   5000
1  Off-White     Mrs. Dozie   3000
2     Rochas    Mr. Adeleke   4000
3     Rochas   Mrs. Arinola   5500
4  Jacquemus    Ms. Ademola   4500
5  Jacquemus   Mrs. Fashola   1200
6  Louboutin    Mr. Fagbemi   3450
7  Louboutin     Mrs. Amike   4520

In [0]:
df = pd.DataFrame(data)

In [18]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [19]:
df.groupby('Company')

In [20]:
df1.groupby('Brand')

You can save this object as a new variable:

In [0]:
by_comp = df.groupby("Company")

In [0]:
by_brand = df1.groupby("Brand")

In [0]:
by_Cust = df1.groupby("Customers Name")

And then call aggregate methods off the object:

In [23]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [25]:
by_brand.mean()

           Sales
Brand
Jacquemus   2850
Louboutin   3985
Off-White   4000
Rochas      4750

In [29]:
df1.groupby('Brand').mean()

           Sales
Brand
Jacquemus   2850
Louboutin   3985
Off-White   4000
Rochas      4750

In [30]:
df1.groupby('Customers Name').mean()

                Sales
Customers Name
Mr. Adeleke      4000
Mr. Fagbemi      3450
Mrs. Amike       4520
Mrs. Arinola     5500
Mrs. Dozie       3000
Mrs. Fashola     1200
Mrs. Otodela     5000
Ms. Ademola      4500

In [0]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [31]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [32]:
by_brand.std()

                 Sales
Brand
Jacquemus  2333.452378
Louboutin   756.604256
Off-White  1414.213562
Rochas     1060.660172

In [33]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [34]:
by_brand.max()

          Customers Name  Sales
Brand
Jacquemus    Ms. Ademola   4500
Louboutin     Mrs. Amike   4520
Off-White   Mrs. Otodela   5000
Rochas      Mrs. Arinola   5500

In [35]:
by_brand.min()

          Customers Name  Sales
Brand
Jacquemus   Mrs. Fashola   1200
Louboutin    Mr. Fagbemi   3450
Off-White     Mrs. Dozie   3000
Rochas       Mr. Adeleke   4000

In [36]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [37]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [38]:
by_brand.count()

           Customers Name  Sales
Brand
Jacquemus               2      2
Louboutin               2      2
Off-White               2      2
Rochas                  2      2

In [39]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [40]:
by_brand.describe()

          Sales
          count    mean          std     min     25%     50%     75%     max
Brand
Jacquemus   2.0  2850.0  2333.452378  1200.0  2025.0  2850.0  3675.0  4500.0
Louboutin   2.0  3985.0   756.604256  3450.0  3717.5  3985.0  4252.5  4520.0
Off-White   2.0  4000.0  1414.213562  3000.0  3500.0  4000.0  4500.0  5000.0
Rochas      2.0  4750.0  1060.660172  4000.0  4375.0  4750.0  5125.0  5500.0

In [41]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [42]:
by_brand.describe().transpose()

Brand          Jacquemus    Louboutin    Off-White       Rochas
Sales count     2.000000     2.000000     2.000000     2.000000
      mean   2850.000000  3985.000000  4000.000000  4750.000000
      std    2333.452378   756.604256  1414.213562  1060.660172
      min    1200.000000  3450.000000  3000.000000  4000.000000
      25%    2025.000000  3717.500000  3500.000000  4375.000000
      50%    2850.000000  3985.000000  4000.000000  4750.000000
      75%    3675.000000  4252.500000  4500.000000  5125.000000
      max    4500.000000  4520.000000  5000.000000  5500.000000

In [43]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [45]:
by_brand.describe().transpose()['Rochas']

Sales  count       2.000000
       mean     4750.000000
       std      1060.660172
       min      4000.000000
       25%      4375.000000
       50%      4750.000000
       75%      5125.000000
       max      5500.000000
Name: Rochas, dtype: float64

In [47]:
by_brand.describe().transpose()['Louboutin']

Sales  count       2.000000
       mean     3985.000000
       std       756.604256
       min      3450.000000
       25%      3717.500000
       50%      3985.000000
       75%      4252.500000
       max      4520.000000
Name: Louboutin, dtype: float64

In [49]:
by_brand.describe().transpose()['Off-White']

Sales  count       2.000000
       mean     4000.000000
       std      1414.213562
       min      3000.000000
       25%      3500.000000
       50%      4000.000000
       75%      4500.000000
       max      5000.000000
Name: Off-White, dtype: float64

In [50]:
by_brand.describe().transpose()['Jacquemus']

Sales  count       2.000000
       mean     2850.000000
       std      2333.452378
       min      1200.000000
       25%      2025.000000
       50%      2850.000000
       75%      3675.000000
       max      4500.000000
Name: Jacquemus, dtype: float64

In [52]:
by_Cust.describe()

               Sales
               count    mean std     min     25%     50%     75%     max
Customers Name
Mr. Adeleke      1.0  4000.0 NaN  4000.0  4000.0  4000.0  4000.0  4000.0
Mr. Fagbemi      1.0  3450.0 NaN  3450.0  3450.0  3450.0  3450.0  3450.0
Mrs. Amike       1.0  4520.0 NaN  4520.0  4520.0  4520.0  4520.0  4520.0
Mrs. Arinola     1.0  5500.0 NaN  5500.0  5500.0  5500.0  5500.0  5500.0
Mrs. Dozie       1.0  3000.0 NaN  3000.0  3000.0  3000.0  3000.0  3000.0
Mrs. Fashola     1.0  1200.0 NaN  1200.0  1200.0  1200.0  1200.0  1200.0
Mrs. Otodela     1.0  5000.0 NaN  5000.0  5000.0  5000.0  5000.0  5000.0
Ms. Ademola      1.0  4500.0 NaN  4500.0  4500.0  4500.0  4500.0  4500.0

In [54]:
by_Cust.describe().transpose()['Mrs. Otodela']

Sales  count       1.0
       mean     5000.0
       std         NaN
       min      5000.0
       25%      5000.0
       50%      5000.0
       75%      5000.0
       max      5000.0
Name: Mrs. Otodela, dtype: float64

# Great Job!